{"name":"home","allTables":[],"allParagraphs":[{"type":"paragraph"}," Toggle Menu ",{"type":"paragraph"}," ",{"type":"paragraph"}," I submitted the marks this afternoon. They should be uploaded and visible through MyUNSW by sometime tomorrow. I don't load them into Webcms3, so you'll just have to wait. If you qualify for a Sympathy Supp, you'll get email tonight. If you have a Supp by virtue of Special Consideration, I'll also send details tonight. It took so long because these days, UNSW Exams Branch schedules the Supps, and they didn't tell us until the other day. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Thanks for the MyExperience feedback. ",{"type":"paragraph"}," Comments like ",{"type":"paragraph"}," have convinced me that it's time to move on and let someone competent teach the course. ",{"type":"paragraph"}," I'll make sure we have a new lecturer for 19T2 who's willing to make the course much better than it was this semester. And who is willing to fix all the structural/organisational problems that you pointed out. ",{"type":"paragraph"}," Who says we don't listen to feedback? ",{"type":"paragraph"}," Update : can someone delete that discussion from the UNSW Discussion forum? It's embarrassing. I wasn't bullied. And the posters of the above comments don't deserve the abuse. They're not at all a minority. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Exams Branch have finally scheduled the COMP1521 Supp Exam. ",{"type":"paragraph"}," Morning of Friday 14 December in the CSE Labs on level 3 of J17. Reading time at 8:50am. ",{"type":"paragraph"}," The format will be the same as the original Final Exam (on November 5). ",{"type":"paragraph"}," If you applied for a supp based on special consideration, you will definitely be sitting the supp. ",{"type":"paragraph"}," Anyone who gets one based on the \"sympathy supp\" rule will be informed by the end of this week. ",{"type":"paragraph"}," Sympathy Supp Exams are available to students who ",{"type":"paragraph"}," Passing a Sympathy Supp gives you max overall mark of 50 PS ",{"type":"paragraph"},"",{"type":"paragraph"},"Back to top "]}