{"name":"view-all-notices-","allTables":[],"allParagraphs":[{"type":"paragraph"}," Toggle Menu ",{"type":"paragraph"}," ",{"type":"paragraph"}," I submitted the marks this afternoon. They should be uploaded and visible through MyUNSW by sometime tomorrow. I don't load them into Webcms3, so you'll just have to wait. If you qualify for a Sympathy Supp, you'll get email tonight. If you have a Supp by virtue of Special Consideration, I'll also send details tonight. It took so long because these days, UNSW Exams Branch schedules the Supps, and they didn't tell us until the other day. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Thanks for the MyExperience feedback. ",{"type":"paragraph"}," Comments like ",{"type":"paragraph"}," have convinced me that it's time to move on and let someone competent teach the course. ",{"type":"paragraph"}," I'll make sure we have a new lecturer for 19T2 who's willing to make the course much better than it was this semester. And who is willing to fix all the structural/organisational problems that you pointed out. ",{"type":"paragraph"}," Who says we don't listen to feedback? ",{"type":"paragraph"}," Update : can someone delete that discussion from the UNSW Discussion forum? It's embarrassing. I wasn't bullied. And the posters of the above comments don't deserve the abuse. They're not at all a minority. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Exams Branch have finally scheduled the COMP1521 Supp Exam. ",{"type":"paragraph"}," Morning of Friday 14 December in the CSE Labs on level 3 of J17. Reading time at 8:50am. ",{"type":"paragraph"}," The format will be the same as the original Final Exam (on November 5). ",{"type":"paragraph"}," If you applied for a supp based on special consideration, you will definitely be sitting the supp. ",{"type":"paragraph"}," Anyone who gets one based on the \"sympathy supp\" rule will be informed by the end of this week. ",{"type":"paragraph"}," Sympathy Supp Exams are available to students who ",{"type":"paragraph"}," Passing a Sympathy Supp gives you max overall mark of 50 PS ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Sorry guys, but marking is dragging on and on and on and on and on ... ",{"type":"paragraph"}," It's unlikely that we'll have the final marks in by the deadline for us to submit marks. This means that you will all likely end up with a grade of \"LE\" for the course when marks are published. All that this means is \"You lecturer didn't get marks in on time\"; it's not a problem with anything you've done. ",{"type":"paragraph"}," In the meantime, lab and assignment marks will gradually appear via sturec or Webcms3 or however else you check your marks. If you have a problem with any mark, send me email and I'll add it to my TODO list, and it will all get cleaned up once marks are finalised. ",{"type":"paragraph"}," Let me be more precise about timings ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," I am not going to answer any more emails along the lines of \"I messed up the exam. Can I have a Supp?\" ",{"type":"paragraph"}," The conditions for getting a Supp were spelled out in the first lecture: ",{"type":"paragraph"}," https://www.cse.unsw.edu.au/~cs1521/18s2/lectures/week01/slide028.html ",{"type":"paragraph"}," The ExamMark referred to on that slide is the scaled exam mark. ",{"type":"paragraph"}," Supps will be on or around December 9. Don't leave town and don't leave the country if you think you might need a Supp. If you don't attend a Supp when offered, your original (scaled) exam mark stands. ",{"type":"paragraph"}," You will be informed on whether you qualify for a \"Sympathy Supp\" whenever all the marking is done (not before November 21). ",{"type":"paragraph"}," If you apply for a Supp based on genuine special consideration, you'll be informed via email from the Special Consideration web site. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Before I get asked the same question again and again ... ",{"type":"paragraph"}," What is available ",{"type":"paragraph"}," What you should bring ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Before 100 more people ask ... ",{"type":"paragraph"}," The check and exe commands, needed to run your attempts at the prac questions, are in the directory /home/cs1521/bin , and assume that this directory is in your command PATH . (The notion of a command path ought to be familiar from assignment 2) ",{"type":"paragraph"}," To set up your command PATH appropriately, try running the following command from a shell under VLab or on any CSE Lab workstation and then doing the questions there ",{"type":"paragraph"}," Do not put spaces anywhere in the above command except between export and PATH . ",{"type":"paragraph"}," In the real Final Exam, all of this will be done for you, so you can focus on solving the problems. ",{"type":"paragraph"}," Note: the original versions of check and exe in /home/cs1521/bin didn't quite work with the 17s2 exam setup. I've modified them so they do, so all of the above should now work. If you really want the original check and exe, they are now in /home/cs1521/bin as check.old and exe.old ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Sorry everyone, but the way things are going, your assignment marks will not be ready before the final exam. ",{"type":"paragraph"}," I think it would be more useful for you at the moment if I prepare solutions for the sample exams, and then get back to sorting out the assignment marking. ",{"type":"paragraph"}," Your quiz marks are already done and the Lab marks (including the practice prac exam) ought to be finalised by Monday. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Your exam seating details are now available. ",{"type":"paragraph"}," For the morning session, it tells you which lab and which seat in that lab. ",{"type":"paragraph"}," For the afternoon session, it tells you which room to go to for corralling. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," If you want to select a particular session for the COMP1521 Final Exam, use this form: ",{"type":"paragraph"}," https://cgi.cse.unsw.edu.au/~cs1521/18s2/seating/final/register.cgi ",{"type":"paragraph"}," We have already allocated students who have another exam on that day (to avoid the potential clash) and have allocated students with special needs. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," COMP1521 Tutes and Labs are running in Week 12. ",{"type":"paragraph"}," In the tutes, tutors will be doing a post-mortem on the Practice Prac Exams and discussing how you can avoid in the Final Exam any problems you might have had last week. ",{"type":"paragraph"}," There is no new exercise for the labs. The aim is to clean up all of the outstanding lab demos and get everything that you've submitted graded. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," As I noted in the Forum, it's almost impossible to give you a set of check tests that will actually work in whatever environment you're running mymysh in. However, I've put up some suggestions for testing which might help. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," A quick reminder that you have a Practice Prac Exam in the labs in the coming week (Week 11). ",{"type":"paragraph"}," Two hours, in the exam environment, to solve one small MIPS and one small C exercise. ",{"type":"paragraph"}," No books, phones, bags, etc. at your desk. Treat it like the Final Exam. ",{"type":"paragraph"}," Worth double the marks compared to other labs. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Jake Fitzgerald and Hugh Chan have developed a nice tool for making educational videos. We've been using it to give some background for the labs (initially as Soln, then as Snack). They would appreciate some feedback on how well the tool works for education and have set up a Survey . Please fill it out if you've used their videos during the semester. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Reminder: there'll be an optional lecture/tutorial on debugging tomorrow (Wed 3 Oct) in Mathews A. Useful if you're worried about how you'll deal with problems in a Prac Exam environment. We'll look at both gdb and qtspim . ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," The systems programmers have been updating the C libraries and seem to have broken some things on the CSE servers. I have asked them how to fix it (recompiling doesn't seem to work) or whether they can do something to fix it. I have no idea how long it will take. I'll update this Notice when it's fixed. ",{"type":"paragraph"}," I recompiled ~cs1521/bin/mymysh again and it now seems to run (on williams, at least). ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Quiz 6 is due soon. Less than 1/3 of the class has attempted it. ",{"type":"paragraph"}," Check the Notice on Assignment 2 Updates, to keep up-to-date with any changes (you'll need to click on \"view all notices ...\" to see it). ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," There is a tute and lab as usual in Week 10. Since Monday is a public holiday, anyone with a Monday tute/lab should attend a class on a different day for Week 10. For Monday people, there is no need to get your Week 09 labs marked in Week 10; there is a lab in Week 12 where you can sort out all of your outstanding lab marks. ",{"type":"paragraph"}," The Week 11 lab is a practice prac exam. You have to write one MIPS program and one C program in two hours, under exam conditions. This lab is worth twice as much as your other labs. ",{"type":"paragraph"}," There will be a tutorial-lecture in Week 10 on Wednesday at 4pm in Mathews A to look at how to use debuggers to help sort out problems in the practice prac exam and the final exam. This is the only lecture in weeks 10/11/12. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," This Wednesday (September 19) will be the last formal lecture for COMP1521. ",{"type":"paragraph"}," We've completed our 4-hours/week over 9 weeks lecture timetable (in preparation for UNSW3+). ",{"type":"paragraph"}," Wael will talk about networks, and then I'll review the course and talk about the exam. ",{"type":"paragraph"}," We'll do at least one more optional lecture on the Tuesday after the break, discussing exam technique, esp. debugging, to help to get you through the Week 11 Practice Prac Exam and the Final Exam. ",{"type":"paragraph"}," Tutes and labs will continue in Weeks 10, 11 and 12 (with the Week 11 lab being the Practice Prac Exam). ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," If I think the spec and mymysh need updating, I'll update the timestamps here ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," The spec and template code for Assignment 2 are now available. ",{"type":"paragraph"}," Let me know ASAP if there are any problems. ",{"type":"paragraph"}," While I was implementing my solution, I decided that the pipe functionality blew up the complexity too much, so I've \"relegated\" it to Challenge status. I think there's already plenty to keep you going. ",{"type":"paragraph"}," As you ask questions on the spec, if I think the spec needs updating, I'll add the new text in red . ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," COMP1521 Quiz 5 is due Sunday midnight. So far (Sat 2pm) only 200/740 people have attempted it. It's worth a couple of marks, but is mainly intended to reinforce ideas we've talked about in lectures recently. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," If you do it today (Fri 31 Aug), then you won't have to pay for the course *and* it won't appear on your academic transcript. ",{"type":"paragraph"}," If you're an international student, dropping courses can have Visa implications. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," As supplied, the delay function in scroll.s will be way too slow. The numbers work fine for compiled C, but for interpreted MIPS assembler (which is 1000 times slower). Tweak the loop bounds in delay until you get decent scrolling speed. ",{"type":"paragraph"}," While you're debugging (e.g. in qtspim) the delay is not helpful. The simplest fix would be to comment out the call to delay in the main program. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," We posted the Assignment 1 Spec and ZIP file the other day, and people have picked up some problems in the scroll.s file. We fixed these (hopefully!) and posted a new version of assign1.zip at 4.20pm 7:00pm on Sat 18 August , 2:30pm on Sun 19 August. If you picked up a version before this, you might want to get the new version (after making sure that you save copies of any code that you already added). ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," I've put up the complete C code for Assignment 1, so that you can read and understand it before thinking about translating into MIPS. If it's too difficult to follow just from the code, the spec (when released) will describe how it all fits together. In the meantime, you can play with the program by unzip'ing and then typing make and running the compiled scroll program ( ./scroll ) ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Jake Fitzgerald and Hugh Chan have made some videos to explain some of the concepts behind the week 03 lab. Take a look before you go to the lab. Once you're in the lab, the only useful way to watch will be on your laptop using headphones. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," I'd like to find out how much exposure you've had to the debugging process and gdb in particular. ",{"type":"paragraph"}," I've set up a Poll to find out. Please give some feedback. Thanks, jas ",{"type":"paragraph"}," Note that I've been setting up the Makefiles for labs to use gcc rather than dcc . If you want to use dcc to get better error messages, that might also help with debugging, edit the Makefile and replace gcc near the top of the file by dcc . ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Ooops ... I messed up the audio on yesterday's lecture video (the one that I made). ",{"type":"paragraph"}," I must be out of practice ... it will be up on YouTube this afternoon. ",{"type":"paragraph"}," Normally the Tuesday videos will appear on Wednesday morning and the Wednesday videos will appear on Thursday morning. ",{"type":"paragraph"},"",{"type":"paragraph"}," ",{"type":"paragraph"}," Welcome to a new semester of MIPS and Linux and exec()ing and fork()ing!! ",{"type":"paragraph"}," Tutes and Labs start in Week 1 , but ought to be revision from COMP1511/COMP1911. ",{"type":"paragraph"}," Lectures are on Tuesday 2-4 (Science Th) and Wednesday 4-6 (Mathews A). ",{"type":"paragraph"}," If you or you friends trying to enrol in the course, but can't ... just wait a few days. There are students currently enrolled who will have failed the pre-requisite courses and will be automatically dropped from COMP1521 soon. Spots should then open in the lectures and tutes. ",{"type":"paragraph"}," Read the Course Outline as soon as it's available. Make sure you're clear on how the course runs. ",{"type":"paragraph"}," See you all (except the WEB stream students**) on Tuesday. ",{"type":"paragraph"}," (** If you really want to, and if there's room in the lecture theatre, you can also come along too) ",{"type":"paragraph"},"",{"type":"paragraph"},"Back to top "]}